{
  "experience": {
    "netronome": {
      "name": "Netronome Systems",
      "title": "Software Engineer",
      "skills": [
        "C",
        "Lua"
      ],
      "time": {
        "start": "Apr 2016",
        "end": "Sep 2016"
      },
      "description": "Refactored in-house packet generation software to allow configurable bursty traffic patterns, of up to 100Gbps, using a custom memory allocator, improving performance by up to 60% over existing in-house packet generator.\nPatched open source packet generation engine to support Netronome’s network card drivers and in-house traffic pattern generator, allowing the full performance of the Netronome network cards to be tested using open source testing software."
    },
    "symmetry": {
      "name": "Symmetry Electronics",
      "title": "Electrical Engineer",
      "skills": [
        "Swift",
        "Objective-C",
        "C",
        "Embedded devices"
      ],
      "time": {
        "start": "Feb 2015",
        "end": "Apr 2016"
      },
      "links": {
        "product": {
          "name": "Product page",
          "link": "http://www.semiconductorstore.com/pages/asp/Item.asp?ItemNumber=WAB1"
        },
        "repo": {
          "name": "Repository",
          "link": "https://github.com/SymmetryElectronics/EVK2-WAB"
        },
        "wiki": {
          "name": "Wiki",
          "link": "https://github.com/SymmetryElectronics/EVK2-WAB/wiki"
        }
      },
      "description": "Designed and implemented the WAB1 board – a development board which bridges Bluetooth Low Energyand Cellular technologies – allowing simple proof-of-concept development for customers.\nWrote an iOS app for the WAB1 board, as well as examples and documentation for the product."
    }
  },
  "education": {
    "mphil": {
      "uni": "University of Cambridge",
      "date": {
        "start": "Sep 2016",
        "end": "Sep 2017"
      },
      "degree": "MPhil in Scientific Computing",
      "gpa": "8.3 / 10 (First class with Distinction)",
      "courses": [
        "GPUs",
        "Mesh generation",
        "Numerical integration",
        "Numerical differentiation",
        "PDEs and ODEs",
        "Linear systems",
        "Non-linear systems"
      ],
      "thesis": {
        "title": "Embedded boundary methods on highly parallel architectures",
        "abstract": "Embedded boundary methods on Cartesian grids are favourable for GPU computing due to the structures meshes which are used for the computation. However, embedded geometries result in cut-cells in the Cartesian grid, which need to be handled explicitly to remove restrictions on the CFL number for the cut-cells which would lead to degraded performance.\nThe work explores the parallelisation of a cut-cell method on a CPU using native threads, as well as on the GPU using CUDA. The implementation focusses on maximising data processing on block of data on the CPU version to ensure that the block's data remains in L1 cache while being processed. The GPU implementation takes a similar approach by trying to maximise the use of shared memory and registers.\nPerformance profiling was performed using a quad-core Intel i7 6700K CPU and an NVIDIA K20c GPU. The CPU implementation achieved a 3.2x speedup using all four cores compared to a single threaded implementation, and 25x and 8x speedups for the GPU implementation compared to single and four thread implementations, respectively.\nGPU performance was limited by the amount of available shared memory and registers for a block, and it is expected that more recent GPU architectures would provide even greater improvement. Only a single embedded boundary method was implemented, and others are an area of future work which can then be compared to the current implementation.",
        "extra": null
      }
    },
    "hons": {
      "uni": "University of the Witwatersrand",
      "date": {
        "start": "Feb 2012",
        "end": "Nov 2015"
      },
      "degree": "BSc Electrical Engineering (Information)",
      "gpa": "8.0 / 10 (Cum Laude)",
      "courses": [
        "Calculus",
        "Computer networks",
        "Computational maths",
        "Microprocessors",
        "Phyics",
        "Electric circuits",
        "Signal processing"
      ],
      "thesis": {
        "title": "Parahaplo - A Heterogeneous Haplotype Solver",
        "abstract": null,
        "extra": null
      }
    }
  }
}
